MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX534F064H.atdf
         <register caption="UARTx Status and Control Register" name="U5STA" offset="0xa10" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U5STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U5STA__OERR" />
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U5STA__FERR" />
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U5STA__PERR" />
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U5STA__RIDLE" />
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U5STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U5STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U5STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U5STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U5STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U5STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U5STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U5STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U5STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U5STA__ADM_EN" />
         </register>
         <register caption="" name="U1TXREG" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U1TXREG" />
         </register>
         <register caption="" name="U4TXREG" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U4TXREG" />
         </register>
         <register caption="" name="U3TXREG" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U3TXREG" />
         </register>
         <register caption="" name="U6TXREG" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U6TXREG" />
         </register>
         <register caption="" name="U2TXREG" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U2TXREG" />
         </register>
         <register caption="" name="U5TXREG" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U5TXREG" />
         </register>
         <register caption="" name="U1RXREG" offset="0x30" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U1RXREG" />
         </register>
         <register caption="" name="U4RXREG" offset="0x230" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U4RXREG" />
         </register>
         <register caption="" name="U3RXREG" offset="0x430" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U3RXREG" />
         </register>
         <register caption="" name="U6RXREG" offset="0x630" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U6RXREG" />
         </register>
         <register caption="" name="U2RXREG" offset="0x830" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U2RXREG" />
         </register>
         <register caption="" name="U5RXREG" offset="0xa30" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U5RXREG" />
         </register>
         <register caption="" name="U1BRG" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG" />
         </register>
         <register caption="" name="U4BRG" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG" />
         </register>
         <register caption="" name="U3BRG" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG" />
         </register>
         <register caption="" name="U6BRG" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG" />
         </register>
         <register caption="" name="U2BRG" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG" />
         </register>
         <register caption="" name="U5BRG" offset="0xa40" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG" />
         </register>
      </register-group>
      <value-group caption="Stop Selection bit" name="U1MODE__STSEL">
         <value caption="2 Stop bits" name="" value="0x1" />
         <value caption="1 Stop bit" name="" value="0x0" />
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U1MODE__PDSEL">
         <value caption="9-bit data no parity" name="" value="0x3" />
         <value caption="8-bit data odd parity" name="" value="0x2" />
         <value caption="8-bit data even parity" name="" value="0x1" />
         <value caption="8-bit data no parity" name="" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U1MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U1MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U1MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U1MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U1MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1" />
         <value caption="Wake-up is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bits" name="U1MODE__UEN">
         <value caption="UxTX, UxRX and UxBCLK pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x3" />
         <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2" />
         <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U1MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U1MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U1MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx, TRISx and LATx registers; UARTx power consumption is minimal" name="" value="0x0" />
      </value-group>
